/*

    Задание - написать приложение которое будет отображать список пользователей
    которых можно будет вычеркнуть из этого списка.


    1. Импортировать в файл с вашим приложением данные с файла guests.json
    2. Созать основной компонент вашего приложения, который будет отображать основную таблицу
    3. Используя стейт компонента и conditinal rendering сделать динамичное отображение поиска
    4. Поиск дожен при вводе фильтровать список гостей:
      Подсказака: Нужно использовать метод filter и indexOf
    5. Если ничего не найдено - должно выводится соттветствующее сообщение
    6. Выделить элемент списка в отдельный компонент
    7. У компонента списка кнопка "Прибыл" должна вычеркивать человека из списка. (Должно изменятся состояние компонента)

    + бонус стилизировать стилями приложение точно так же как на макете
*/
