/*
  OLD METHODS: REACT VESRION < 16.4
*/
// componentWillMount(){
//   // Выполняется перед тем ка компонент будет смонтирован.
//   // Метод выполняется на сервере, при наличии SSR.
//
//   // Рекомендация с доков -> DR.
//   // Не использовать сайд-эффекты в этом методе.
//   // Сайд эффект - любая функция которая приводит к изменению стейта приложения
//   // Вызов setState() в этом методе НЕ вызовет перерисовку.
//   console.log('UNSAFE.componentWillMount');
// }
// componentWillUpdate(nextProps, nextState){
//   /*
//     В теле этого метода, нельзя вызвать  this.setState().
//     Потому что это вызовет перерисовку до оконцания этой функции.
//
//     Не сработает, если shouldComponentUpdate вернул false.
//   */
//   console.log('UNSAFE.componentWillUpdate');
// }
// componentWillReceiveProps(nextProps){
//   /*
//     Метод вызывается прямо перед тем, как получить новые props.
//     Если нужно сравнить новые и старые пропсы и на основе результата провести манипуляцию,
//     в результате которой будет изменен стейт, то документация рекоментудет сделать это тут!
//
//     Метод не вызывается при инициализации.
//     Изменение state игнорирует это событие. Работает только с props.
//   */
//   console.log('UNSAFE.componentWillReceiveProps', nextProps);
// }
