/*

  Чистые и "Грязные" функции.
  (Pure and Impure functions)

  Понимание различий между Pure and Unpure функциями важно для написания приложений с использованием Redux.

  Чистыми, являются те функции - которые не имеют побочных эффектов, таких как например запросы в базу данных.
  Они прото вычисляют новое значение на основе полученных данных. По этому они являются предсказуемымми.

  Кроме этого, чистые функции не изменяют переданные им значения.

  */

    // Pure functions
    function square(x){
      return x * x;
    }

    function squareAll(items){
      return items.map(square);
    }

  /*

  "Грязные" функции могут делать отправлять запросы в базу данных или могут иметь побочные эффекты,
  например, как работа с DOM, и они могут переопределять значения, которые вы передаете им.
  Это важное отличие, потому что некоторые из функций, которые мы будем писать в Redux, должны
  быть чистыми только чистыми.

*/
    // Impure functions
    function unpureSquare(x){
      updateInDataBase(x);
      return x * x;
    }

    function unpureSquareAll(items){
      for( let i = 0; i < items.length; i++){
        items[i] = unpureSquare(items[i]);
      }
    }
